GLGDLY/intelligence_shoepad_mainboard/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.3.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_PTRVAL=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_DEBUG_STUBS_ENABLE=y
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
CONFIG_MQTT_PROTOCOL_5=y
CONFIG_MQTT_USE_CUSTOM_CONFIG=y
CONFIG_MQTT_TASK_PRIORITY=4
CONFIG_MQTT_USE_CORE_1=y
